{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 70], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, 70], "dtype": "float32", "input_dim": 30903, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 70}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "bidirectional_14", "class_name": "Bidirectional", "config": {"name": "bidirectional_14", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.1, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "time_distributed_13", "class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_14", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "output_layers": [["time_distributed_13", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "bidirectional_14_1/forward_lstm_14/kernel", "shape": [50, 128], "dtype": "float32"}, {"name": "bidirectional_14_1/forward_lstm_14/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_14_1/forward_lstm_14/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_14_1/backward_lstm_14/kernel", "shape": [50, 128], "dtype": "float32"}, {"name": "bidirectional_14_1/backward_lstm_14/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_14_1/backward_lstm_14/bias", "shape": [128], "dtype": "float32"}, {"name": "embedding_14_1/embeddings", "shape": [30903, 50], "dtype": "float32"}, {"name": "time_distributed_13_1/kernel", "shape": [64, 9], "dtype": "float32"}, {"name": "time_distributed_13_1/bias", "shape": [9], "dtype": "float32"}]}]}